app/Controllers/DashboardController.php

    public function index()
    {
        $scheduleModel = new ScheduleModel();
        $devotionModel = new DevotionModel();
        $memberModel = new MemberModel();

        $data = [
            'nextSchedule' => $scheduleModel->getNextSchedule(),
            'latestDevotion' => $devotionModel->getLatestDevotion(),
            'members' => $memberModel->findAll(),
---
SELECT *
FROM `members`