app/Controllers/DevotionController.php

    public function index()
    {
        $data['devotions'] = $this->devotionModel->findAll();
---
SELECT *
FROM `devotions`