app/Controllers/MemberController.php

SELECT *
FROM `members`
---
    public function index()
    {
        $data['members'] = $this->memberModel->findAll();