app/Controllers/ScheduleController.php

SELECT *
FROM `schedules`
---
    public function index()
    {
        $data['schedules'] = $this->scheduleModel->findAll();

SELECT *
FROM `schedules`
WHERE `schedules`.`id` = '2'
---
    public function edit($id)
    {
        $data['schedule'] = $this->scheduleModel->find($id);

UPDATE `schedules` SET `service_name` = 'keluarga', `date` = '2024-01-03', `time` = '04:00'
WHERE `schedules`.`id` IN ('2')
---
    public function update($id)
    {
        $this->scheduleModel->update($id, [
            'service_name' => $this->request->getPost('service_name'),
            'date'         => $this->request->getPost('date'),
            'time'         => $this->request->getPost('time'),
        ]);