app/Models/DevotionModel.php

    public function getLatestDevotion()
    {
        return $this->orderBy('date', 'desc')->first();
---
SELECT *
FROM `devotions`
ORDER BY `date` DESC
 LIMIT 1