app/Models/ScheduleModel.php

    public function getNextSchedule()
    {
        return $this->where('date >=', date('Y-m-d'))->orderBy('date', 'asc')->first();
---
SELECT *
FROM `schedules`
WHERE `date` >= '2024-12-01'
ORDER BY `date` ASC
 LIMIT 1