app/Models/UserModel.php

    public function insertUser($data)
    {
        return $this->save($data);
---
INSERT INTO `users` (`username`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('bian', 'bian@gmail.com', '$2y$10$pbGEH2.vQDxpxpfKxzLVCeKW8EonAIktmGT3jveQq2MijqhiYIStC', 'jemaat', '2024-12-01 12:27:16', '2024-12-01 12:27:16')